## D - Data Extraction and Transformation - Personal Capstone Project

This notebook shows how to apply and combine the learned steps from previous labs to reach a specific output. The goal here is to extract the top 5 banks according to the market cap in USD. Then use the exchange rate API to find the exchange rate of the British Pound. Lastly, convert the market cap unit from USD to British Pound. The output should be the top 5 banks according to the market cap but this time in GBP instead of US dollars.

In [1]:
# Import necessary libraries
import html5lib
import requests
import pandas as pd

### Step 1 - Webscrap the Data from Wikipedia

In [2]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_banks'
html_data = requests.get(url).text  #to get the html of the website

In [3]:
dataframe_list = pd.read_html(url, flavor='bs4')
banks_ranking = dataframe_list[3]
banks_ranking.head()

   Rank                                Bank name Market cap(US$ billion)
0     1                           JPMorgan Chase               400.37[6]
1     2  Industrial and Commercial Bank of China                  295.65
2     3                          Bank of America                  279.73
3     4                              Wells Fargo                  214.34
4     5                  China Construction Bank                  207.98

In [4]:
banks_ranking.iloc[0,2] = 400.37 # Remove the reference [6]

In [5]:
banks_ranking.head()

   Rank                                Bank name Market cap(US$ billion)
0     1                           JPMorgan Chase                  400.37
1     2  Industrial and Commercial Bank of China                  295.65
2     3                          Bank of America                  279.73
3     4                              Wells Fargo                  214.34
4     5                  China Construction Bank                  207.98

In [6]:
### - Step 2: Find the exchange rates for today
url = "https://api.apilayer.com/exchangerates_data/latest?base=EUR&apikey=73qhjmN9pymxALkF0hD0h5ySe4nh7HNs" # Rates API
html_data = requests.get(url) # the response will be json file
currency_df = pd.DataFrame(html_data.json())
currency_df.drop(['success','timestamp','date','base'], axis = 1, inplace = True)
currency_df.head()

          rates
AED    3.661804
AFN   88.783389
ALL  116.789016
AMD  417.244163
ANG    1.804621

### Step 3 - Convert the Unit of Market Cap from US$ Billion to UKÂ£ Billion

In [7]:
GBP = currency_df.loc['GBP']
GBP.astype(float)[0]

0.875993

In [8]:
banks_ranking['Market cap(US$ billion)'] = banks_ranking['Market cap(US$ billion)'].astype(float)

In [9]:
banks_ranking.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Rank                     50 non-null     int64
 1   Bank name                50 non-null     object
 2   Market cap(US$ billion)  50 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

In [10]:
banks_ranking['Market cap(UKÂ£ Billion)'] = round(banks_ranking['Market cap(US$ billion)']*GBP.astype(float)[0],2)
banks_ranking.head()

,Rank,Bank name,Market cap(US$ billion),Market cap(UKÂ£ Billion)
0,1,JPMorgan Chase,400.37,350.72
1,2,Industrial and Commercial Bank of China,295.65,258.99
2,3,Bank of America,279.73,245.04
3,4,Wells Fargo,214.34,187.76
4,5,China Construction Bank,207.98,182.19